app/views/user_books/new.html.erb

    <%= f.label :user_id %>
    <%= f.collection_select :user_id, User.all, :id, :username, prompt: "Select a user" %>
---
SELECT "users".* FROM "users"

    <%= f.label :book_id %>
    <%= f.collection_select :book_id, Book.all, :id, :title, prompt: "Select a book" %>
---
SELECT "books".* FROM "books"