app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."title" ASC
---
  def index
    @books = Book.order(:title)

INSERT INTO "books" ("title", "author", "price", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "DoesThisWork"], ["author", "IHopeSo"], ["price", "123.0"], ["date", "2025-01-27"], ["created_at", "2025-01-28 05:41:04.009485"], ["updated_at", "2025-01-28 05:41:04.009485"]]
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "price" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["price", "124.0"], ["updated_at", "2025-01-28 07:48:19.228531"], ["id", 2]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def delete
    @book = Book.find(params[:id])